from emotion_analyzer import analyzer

text = """浅浅和小泡泡当然不会瞬移，之所以凭空出现，完全是突然玩心高涨的浅浅在捣乱：她先停止了周围相当大面积范围内的时间，然后拉着小泡泡慢慢悠悠地从对方后面走过去，站在他们面前大约十米远的地方，期间小泡泡因为好奇而跑出去拽那些奇形怪状的铁架子三次，浅浅把小泡泡抱回来三次，然后又领着手上沾满了铁锈的小泡泡去不远处找水管洗了把手，用手机给洗完手之后举着双手伸到自己面前检查的小泡泡照了张可爱的照片，在废弃过道的入口处写上了“许浅浅携小泡泡到此一游”一行字，因为写的不好看还把时间倒退重新写了一边，再然后才到两个傻呆呆地站了好久的“劫匪”面前话三分钟选择造型……

最后的最后，两个被当成玩具的倒霉家伙看到了面前“瞬间出现”的少女和萝莉……

完全不知道这两个闲极无聊的人在刚才究竟做了多少乱七八糟的事情……

“今天天气不错，”浅浅抬头看了看天空，然后耸耸肩，“黄泉路上晴朗无云日照强度中，很适宜转世轮回呢。”"""

import re
sentences = re.split(r'([。！？…；\.\!\?\;]+["\'\）\)」』】]?)\s*', text)
sentences = ["".join(i).strip() for i in zip(sentences[0::2], sentences[1::2] + [""])]

for s in sentences:
    if s:
        emotion = analyzer.analyze(s)
        print(f"[{emotion.upper()}] - {s}")